Tekla Open API Reference for Tekla Structures 2025
Matrix.Transform Method (Point)
 Transforms the given point using the current matrix.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point Transform(
	Point p
)
Public Function Transform (
	p As Point
) As Point
Parameters
p
Type: Tekla.Structures.Geometry3d.Point
The point to be transformed.
Return Value
Type: Point
The new transformed point.
See Also
Reference
Matrix Class
Transform Overload
Tekla.Structures.Geometry3d Namespace